rawdata = {
'火曜日(二) 少女たちよ':{
  'Easy' : ['梅田綾乃','高橋朱里','岩田華怜','名取稚菜','高城亜樹'],
  'Normal' : ['鈴木紫帆里','阿部マリア','鈴木まりや','近野莉菜','峯岸みなみ'],
  'Hard'  :  ['宮崎美穗','中田ちさと','佐藤すみれ','石田晴香','高橋みなみ']
},
'水曜日(三) 初日':{
  'Easy'   :  ['岡田奈々','高島祐利奈','岡田彩花','岩立沙穗','入山杏奈'],
  'Normal' : ['平田梨奈','大森美優','藤田奈那','竹內美宥','松井珠理奈'],
  'Hard'   : ['岩佐美咲','武藤十夢','田野優花','片山陽加','島崎遥香']
},
'木曜日(四) 少女たちよ' :{
  'Easy'   : ['佐藤亞美菜','橋本耀','篠崎彩奈','森川彩香','川榮李奈'],
  'Normal' : ['小林茉里奈','伊豆田莉奈','島田晴香','內田真由美','島崎遙香'],
  'Hard'   : ['小林香菜','菊地あやか','兒玉遙','永尾まりや','小嶋陽菜']
},
'金曜日(五) 初日':{
  'Easy'   : ['西野未姬','北澤早紀','佐々木優佳里','竹內美宥','小林香菜'],
  'Normal' : ['小林茉里奈','野中美鄉','山內鈴蘭','佐藤すみれ','倉持明日香'],
  'Hard'   : ['石田晴香','藤江れいな','橫山由依','梅田彩佳','柏木由紀']
},
'土曜日(六) 少女たちよ':{
  'Easy'   : ['野澤玲奈','前田美月','內山奈月','茂木忍','梅田彩佳'],
  'Normal' : ['大島涼花','田名部生來','大家志津香','松井咲子','橫山由依'],
  'Hard'   : ['前田亞美','大場美奈','矢倉楓子','藤江れいな','柏木由紀']
},
'土曜日(六) 初日':{
  'Easy'   : ['野澤玲奈','前田美月','內山奈月','茂木忍','梅田彩佳'],
  'Normal' : ['大島涼花','田名部生來','大家志津香','松井咲子','橫山由依'],
  'Hard'   : ['前田亞美','大場美奈','矢倉楓子','藤江れいな','柏木由紀']
},
'日曜日(日) 少女たちよ':{
  'Easy'   : ['前田美月','高島祐利奈','平田梨奈','阿部マリア','田名部生來'],
  'Normal' : ['小嶋菜月','島田晴香','宮崎美穗','岩佐美咲','田野優花'],
  'Hard'   : ['菊地あやか','永尾まりや','峯岸みなみ','北原里英','高橋みなみ']
},
'日曜日(日) 初日':{
  'Easy'   : ['岡田奈々','大島涼花','岩田華怜','鈴木まりや','中田ちさと'],
  'Normal' : ['伊豆田莉奈','內田真由美','市川美織','大場美奈','片山陽加'],
  'Hard'   : ['矢倉楓子','川榮李奈','小嶋陽菜','渡邊美優紀','島崎遙香']
}
}

data={}

keys = Object.keys(rawdata)

diff = ['C','B','A','S','SS']

for( i in keys){
  key = keys[i]
  t = rawdata[key];
  subkeys = Object.keys(t)
  for (j in subkeys) {
    subkey = subkeys[j]
    list = t[subkey]
    for (k in list) {
      member = list[k]
      if (member in data){
        data[member].push(key + ' ' + subkey + ' 難易' + diff[k])
      }else{
        data[member] = []
        data[member].push(key + ' ' + subkey + ' 難易' + diff[k])
      }
      
    };
  };
}

console.log(JSON.stringify(data))

